# PointCloudColorSettings Constructor (Color, Color)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PointCloudColorSettings Constructor (Color, Color)
PointCloudColorSettings Class See Also
---
Constructs color settings object from given colors.
**Namespace:** Autodesk.Revit.DB.PointClouds**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public PointCloudColorSettings(
	Color color1,
	Color color2
)
```

Visual Basic
---
```text
Public Sub New ( _
	color1 As Color, _
	color2 As Color _
)
```

Visual C++
---
```text
public:
PointCloudColorSettings(
	Color^ color1,
	Color^ color2
)
```

# ### Parameters
color1
    Type: Autodesk.Revit.DB..::..Color
color2
    Type: Autodesk.Revit.DB..::..Color
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
PointCloudColorSettings Class
PointCloudColorSettings Overload
Autodesk.Revit.DB.PointClouds Namespace